#pragma once
#include <memory>


namespace Formicarium
{
	///-------------------------------------------------------------------------





	 ///------------------------------------------------------------------------
	///
	///
	///
	/// Описание клетки с температурой
	///
	///
	///-------------------------------------------------------------------------
	class ACellTemperature
	{
	public:

		ACellTemperature();
		virtual ~ACellTemperature();


	public:







	private:




	};
	///-------------------------------------------------------------------------




}
